app/controllers/students_controller.rb

SELECT  "students".* FROM "students" WHERE (1) LIMIT ?  [["LIMIT", 1]]
---
  def show
    @students = Student.find_by(params[:id])